# 고속 피보나치에서 행렬 연산 간소화 (Python3 / 44 ms / 32412 KB)
n = int(input())

f_k, f_k1 = 0, 1
for b in bin(n+1)[2:]:
    f_2k = (f_k * (2 * f_k1 - f_k)) % 15746
    f_2k1 = (f_k1**2 + f_k**2) % 15746

    # 0이면 2배 점프
    if b == '0':
        f_k, f_k1 = f_2k, f_2k1
    # 1이면 2배 점프 후 1 더하기
    else:
        f_k, f_k1 = f_2k1, (f_2k + f_2k1) % 15746

print(f_k)

# ---------------------------------------------------------------------------------
# # 고속 피보나치 (Python3 / 36 ms / 32544 KB)
# # 2x2 행렬 곱셈
# def mul(a, b):
#     c = [[0, 0], [0, 0]]
#     for i in range(2):
#         for j in range(2):
#             for k in range(2):
#                 c[i][j] += a[i][k] * b[k][j]
#                 c[i][j] %= 15746

#     return c

# def pow(a, n):
#     # 시작은 단위 행렬
#     r = [[1, 0], [0, 1]]
#     while n > 0:
#         # 이진수에서, 해당 자릿수가 1이라면
#         if n & 1 == 1:
#             r = mul(r, a)   # a 행렬을 곱한다.
#         a = mul(a, a)       # a는 계속해서 자신을 거듭제곱한다. (1 -> 2 -> 4...)
#         n >>= 1
#     return r

# # 피보나치로는 Fn+1을 구해야 한다.
# result = pow([[1, 1], [1, 0]], int(input()))
# print(result[0][0])

# ---------------------------------------------------------------------------------
# # 25분 성공 / (Python3 / 336 ms / 71968 KB) / (PyPy3 / 100 ms / 117360 KB)
# # 이전에 만든 수열에서 끝에 1 또는 00을 붙일 수 있기에 피보나치가 됨
# n = int(input())
# dp = [0] * (n + 1)
# dp[0] = 1
# dp[1] = 1

# for i in range(2, n + 1):
#     dp[i] = (dp[i - 1] + dp[i - 2]) % 15746

# print(dp[n])